package OOP2.Teoriy.Anotacii;
// Анотация это некоторый указатель для нашей программы, который помогает ей понять какой то процесс.
// У анотации есть 2 свойства. 1 это тип хранения нашей анотации. 2 это тип объекта на котором они указываются.
// Типы хранения : 1 Sourse - используется для указания компелятору (выполняется 1 раз и удаляется).
                // 2 Class - JVM ее игнорирует используется для сторонних сервисов.
                // 3 Runtime - может служить чем угодно (универсальная).

// Типы данных которые мы можем анотировать: 1 Package - указывается над каким то пакетом в нашем проекте
                                         //  2 Type - указывается над каким то классом (указываемтип этого класса)
                                        //   3 Methode - указывается над методом
                                        //   4 Constructor - указывается над конструктором
                                        //   5 Field - указывается над полями
                                        //   6 Local_Variable - локальные переменные (объявленные внутри нашей функции)
                                        //   7 Annotation_Type - для каких то очень сложных проектов

public class Lesson {
}
